In [68]:
import pandas as pd

In [69]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Displaying Top 3 Rows of the Dataset

In [70]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# Displaying Last 3 Rows of the Dataset

In [71]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Shape of our Dataset (Number of Rows and number of Columns)

In [72]:
df1.shape

(7, 3)

In [73]:
print("Number of Rows: ",df1.shape[0])
print("Number of Columns: ",df1.shape[1])

Number of Rows:  7
Number of Columns:  3

# Total No. of Rows,Total No. of columns,datatype of each column and memory requirement

In [74]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# check null values in the dataset

In [75]:
df1.isnull().sum(axis = 0)

Name      0
Marks     0
Gender    0
dtype: int64

# Get Overall Statistics About the Data Frame

In [76]:
df1.describe() #for only numurical columns

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [77]:
df1.describe(include = 'all') #will include the categorcial values alsop

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# Find unique values for gender column

In [78]:
df1.Gender.unique()

array(['Male', 'Female'], dtype=object)

# Number of unique values from the Gender column

In [79]:
df1.Gender.nunique()

2

# display count of unqiue values in Gender

In [80]:
df1.Gender.value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# Total Number of Stundets Having Marks Between 90 to 100 using Between

In [81]:
df1[df1.Marks >=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [82]:
df1[(df1.Marks >= 90) & (df1.Marks <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [83]:
len(df1[(df1.Marks >= 90) & (df1.Marks <= 100)])

4

In [84]:
df1[df1.Marks.between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [85]:
sum(df1.Marks.between(90,100))

4

# Find Average Marks

In [86]:
df1.Marks.mean()

92.14285714285714

In [87]:
df1.Marks.max()

99

# Apply Method()

In [88]:
def marks(x):
    return x//2

In [89]:
df1['Half_Marks'] = df1.Marks.apply(marks)

In [90]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [91]:
df1.Marks.apply(lambda x: x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [92]:
df1.Name.apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# Map Function

In [93]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [94]:
df1['Gender_num'] = df1.Gender.map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half_Marks  Gender_num
0  Priyang     98    Male          49           1
1   Aadhya     89  Female          44           0
2   Krisha     99  Female          49           0
3   Vedant     87    Male          43           1
4   Parshv     90    Male          45           1
5   Mittal     83  Female          41           0
6  Archana     99  Female          49           0

In [98]:
df1.drop('Gender',axis = 1)

      Name  Marks  Half_Marks  Gender_num
0  Priyang     98          49           1
1   Aadhya     89          44           0
2   Krisha     99          49           0
3   Vedant     87          43           1
4   Parshv     90          45           1
5   Mittal     83          41           0
6  Archana     99          49           0

In [99]:
df1

      Name  Marks  Gender  Half_Marks  Gender_num
0  Priyang     98    Male          49           1
1   Aadhya     89  Female          44           0
2   Krisha     99  Female          49           0
3   Vedant     87    Male          43           1
4   Parshv     90    Male          45           1
5   Mittal     83  Female          41           0
6  Archana     99  Female          49           0

In [100]:
df1.drop(['Gender','Half_Marks'],axis = 1,inplace = True)

In [101]:
df1

      Name  Marks  Gender_num
0  Priyang     98           1
1   Aadhya     89           0
2   Krisha     99           0
3   Vedant     87           1
4   Parshv     90           1
5   Mittal     83           0
6  Archana     99           0

# Columns names

In [102]:
df1.columns

Index(['Name', 'Marks', 'Gender_num'], dtype='object')

In [103]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# sort the DataFrame of the marks column

In [105]:
df1.sort_values('Marks')

      Name  Marks  Gender_num
5   Mittal     83           0
3   Vedant     87           1
1   Aadhya     89           0
4   Parshv     90           1
0  Priyang     98           1
2   Krisha     99           0
6  Archana     99           0

In [106]:
df1.sort_values('Marks',ascending = False)

      Name  Marks  Gender_num
2   Krisha     99           0
6  Archana     99           0
0  Priyang     98           1
4   Parshv     90           1
1   Aadhya     89           0
3   Vedant     87           1
5   Mittal     83           0